In [51]:
import numpy as np
import pandas as pd

In [52]:
sozluk1 = {"isim": ["ayas", "Mehmet", "Asım", "Atıl"],
           "Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"],
           "Kalori": [100, 200, 300, 400]}

In [53]:
dataFrame1 = pd.DataFrame(sozluk1, index=[0, 1, 2, 3])  # indexlerimizi biz belirledik 0,1,2,3

In [54]:
dataFrame1

     isim       Spor  Kalori
0    ayas       Koşu     100
1  Mehmet      Yüzme     200
2    Asım       Koşu     300
3    Atıl  Basketbol     400

In [55]:
sozluk2 = {"isim": ["levent", "tarık", "kaya", "rafet"],
           "Spor": ["Futbol", "Tenis", "Voleybol", "Basketbol"],
           "Kalori": [500, 200, 300, 400]}

In [56]:
dataFrame2 = pd.DataFrame(sozluk2, index=[4, 5, 6, 7]) # indexlerimizi biz belirledik 4,5,6,7

In [57]:
sozluk2 = {"isim": ["Polat", "Faruk", "Onat", "eslem"],
           "Spor": ["Futbol", "Voleybol", "Badminton", "Hentbol"],
           "Kalori": [100, 500, 400, 200]}

In [58]:
dataFrame3 = pd.DataFrame(sozluk2, index=[8, 9, 10, 11]) # indexlerimizi biz belirledik 8,9,10,11

In [59]:
dataFrame1

     isim       Spor  Kalori
0    ayas       Koşu     100
1  Mehmet      Yüzme     200
2    Asım       Koşu     300
3    Atıl  Basketbol     400

In [60]:
dataFrame2

     isim       Spor  Kalori
4  levent     Futbol     500
5   tarık      Tenis     200
6    kaya   Voleybol     300
7   rafet  Basketbol     400

In [61]:
dataFrame3

     isim       Spor  Kalori
8   Polat     Futbol     100
9   Faruk   Voleybol     500
10   Onat  Badminton     400
11  eslem    Hentbol     200

Concatenation

In [62]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # birleştirme işlemi dataframe lerin alt alta eklenmesi

      isim       Spor  Kalori
0     ayas       Koşu     100
1   Mehmet      Yüzme     200
2     Asım       Koşu     300
3     Atıl  Basketbol     400
4   levent     Futbol     500
5    tarık      Tenis     200
6     kaya   Voleybol     300
7    rafet  Basketbol     400
8    Polat     Futbol     100
9    Faruk   Voleybol     500
10    Onat  Badminton     400
11   eslem    Hentbol     200

## Merge birleştirme kaynaştırma

In [63]:
mergeSozluk1 = {"isim": ["ayas", "Mehmet", "Asım", "Atıl"],
                "Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"]}
mergeSozluk2 = {"isim": ["ayas", "Mehmet", "Asım", "Atıl"],
                "Kalori": [100, 200, 300, 400]}

In [64]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [65]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [66]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="isim") # birleştirme işlemi dataframe lerin yan yana eklenmesi isim üzerinden birleştirme işlemi yapıldı.

     isim       Spor  Kalori
0    ayas       Koşu     100
1  Mehmet      Yüzme     200
2    Asım       Koşu     300
3    Atıl  Basketbol     400

In [67]:
maasSozluk = {"isim": ["Selim", "Veli", "Harun", "Resul"],
                "Departman": ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
                "Maas": [200, 300, 400, 500]}

In [68]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [69]:
maasDataFrame

    isim  Departman  Maas
0  Selim    Yazılım   200
1   Veli      Satış   300
2  Harun  Pazarlama   400
3  Resul    Yazılım   500

In [70]:
maasDataFrame["Departman"].unique() # departmanlardaki tekrar edenleri siler

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [71]:
maasDataFrame["Departman"].nunique() # departmanlardaki tekrar edenleri sayar

3

In [72]:
maasDataFrame["Departman"].value_counts() # departmanlardaki tekrar edenleri sayar

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [73]:
def bruttenNete(maas):
    return maas * 0.66

In [74]:
bruttenNete(10000)

6600.0

In [75]:
maasDataFrame["Maas"].apply(bruttenNete) # apply fonksiyonu ile maas kolonundaki değerleri bruttenNete fonksiyonuna gönderdik

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [76]:
maasDataFrame.isnull() # boş değerleri true olarak döndürür

    isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [77]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
                "Karakter Ismi": ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
                "Karakter Yas": [9, 10, 50, 20, 10]}
karakterDF = pd.DataFrame(yeniBirVeri)

In [78]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [79]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"]) # pivot table ile karakter sınıfı ve karakter ismine göre yaş ortalamalarını aldık

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0